Revit 2027 API
LineSegment.EndPoint Property
 End point of the line segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ EndPoint { get; }
Public ReadOnly Property EndPoint As XYZ
	Get
public:
property XYZ^ EndPoint {
	XYZ^ get ();
}
member EndPoint : XYZ with get
Property Value
XYZ
See Also
Reference
LineSegment Class
Autodesk.Revit.DB Namespace